Core/src/src/InformationRegisters/ЗначенияПредопределенныхЭлементовДляРасширений/ЗначенияПредопределенныхЭлементовДляРасширений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияПредопределенныхЭлементовДляРасширений</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ПредопределенныеЭлементыДляРасширений</types>
    </type>
  </resources>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПредопределенныеЭлементыДляРасширений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
  <enumValues>
    <name>Лицензия</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <comment>Банковский счет по умолчанию</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоДоговорам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоДокументам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетОплатыПоСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидГосударственногоОргана</name>
    <type>
      <types>EnumRef.ВидыГосударственныхОрганов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоУмолчанию</name>
    <comment>Договор контрагента по умолчанию</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПривлеченияПокупателя</name>
    <type>
      <types>CatalogRef.ИсточникиПривлеченияПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>КодГосударственногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КППВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <comment>Номер телефона для поиска при вводе по строке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновныеСведения</name>
    <comment>Используется для поиска в списке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <comment>ОГРН для неиностранных контрагентов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПокупателя</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщику</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателем</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщиком</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <comment>ФИО физ лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСПоУмолчанию</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоПодписант</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяНеРезидентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПокупателяРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщикуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателемРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщикомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеТранпсортноеСедство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНерезидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчитатьКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТранспортныеСредства</name>
    <attributes>
      <name>ТранпсортноеСедство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/CommonModules/ВыгрузкаЗаказовНаСкладСервер/Module.bsl
Функция ПолучитьСтруктуруСоединения() ЭКСПОРТ
	
	ПЕРЕМ РЕЗ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ПредопределенныеЭлементыДляРасширений.Значение КАК Значение,
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных КАК НастройкаИмяПредопределенныхДанных
	 |ИЗ
	 |	РегистрСведений.ЗначенияПредопределенныхЭлементовДляРасширений КАК ПредопределенныеЭлементыДляРасширений
	 |ГДЕ
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных = ""CORAX_Host""
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ПредопределенныеЭлементыДляРасширений.Значение,
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных
	 |ИЗ
	 |	РегистрСведений.ЗначенияПредопределенныхЭлементовДляРасширений КАК ПредопределенныеЭлементыДляРасширений
	 |ГДЕ
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных = ""CORAX_HandlingInterfaces""
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ПредопределенныеЭлементыДляРасширений.Значение,
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных
	 |ИЗ
	 |	РегистрСведений.ЗначенияПредопределенныхЭлементовДляРасширений КАК ПредопределенныеЭлементыДляРасширений
	 |ГДЕ
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных = ""CORAX_MessageType""
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ПредопределенныеЭлементыДляРасширений.Значение,
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных
	 |ИЗ
	 |	РегистрСведений.ЗначенияПредопределенныхЭлементовДляРасширений КАК ПредопределенныеЭлементыДляРасширений
	 |ГДЕ
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных = ""CORAX_OutputFormatInterfaces""
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ПредопределенныеЭлементыДляРасширений.Значение,
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных
	 |ИЗ
	 |	РегистрСведений.ЗначенияПредопределенныхЭлементовДляРасширений КАК ПредопределенныеЭлементыДляРасширений
	 |ГДЕ
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных = ""CORAX_Sender""
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ПредопределенныеЭлементыДляРасширений.Значение,
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных
	 |ИЗ
	 |	РегистрСведений.ЗначенияПредопределенныхЭлементовДляРасширений КАК ПредопределенныеЭлементыДляРасширений
	 |ГДЕ
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных = ""CORAX_SenderReference""
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ПредопределенныеЭлементыДляРасширений.Значение,
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных
	 |ИЗ
	 |	РегистрСведений.ЗначенияПредопределенныхЭлементовДляРасширений КАК ПредопределенныеЭлементыДляРасширений
	 |ГДЕ
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных = ""CORAX_Tenant""
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ПредопределенныеЭлементыДляРасширений.Значение,
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных
	 |ИЗ
	 |	РегистрСведений.ЗначенияПредопределенныхЭлементовДляРасширений КАК ПредопределенныеЭлементыДляРасширений
	 |ГДЕ
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных = ""CORAX_TestIndicator""
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ПредопределенныеЭлементыДляРасширений.Значение,
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных
	 |ИЗ
	 |	РегистрСведений.ЗначенияПредопределенныхЭлементовДляРасширений КАК ПредопределенныеЭлементыДляРасширений
	 |ГДЕ
	 |	ПредопределенныеЭлементыДляРасширений.Настройка.ИмяПредопределенныхДанных = ""CORAX_Version""";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураШапки = Новый Структура;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных = "CORAX_Host" Тогда 
			CORAX_Host = СокрЛП(ВыборкаДетальныеЗаписи.Значение);
			Продолжить;
		КонецЕсли;
		
		СтруктураШапки.Вставить(СтрЗаменить(ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных, "CORAX_", ""), СокрЛП(ВыборкаДетальныеЗаписи.Значение));
		
	КонецЦикла;
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL();//ИнтеграцияСНалоговойСлужбыПовтИсп.ПолучитьЗащищенноеСоединение();
	Соединение = Новый HTTPСоединение("swllc1.coraxwms.nl",,,,,,SSL);//CORAX_Host,,,,,,SSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("POST", "https://swllc1.coraxwms.nl/api/interfacing/orders HTTP/1.1");
	Заголовки.Вставить("Authorization", "WRAP access_token=""31656759-708d-4900-b215-6e4e4fca72e5""");
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("User-Agent", "RestSharp/106.3.1.0");
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Host", "swllc1.coraxwms.nl"); //
	Заголовки.Вставить("Content-length", "1301");
	Заголовки.Вставить("Accept-Encoding", "gzip, deflate");
	
	РЕЗ = Новый Структура("Соединение, Заголовки, СтруктураШапки", Соединение, Заголовки, СтруктураШапки);

	Возврат РЕЗ;
	
КонецФункции // ()

Процедура ВыгрузитьЗаказ(МассивСсылок = Неопределено) ЭКСПОРТ
	
	Если МассивСсылок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСоединения = ПолучитьСтруктуруСоединения();
	
	МассивРезультатов = ПолучитьДанныеДокуента(МассивСсылок);
	
	тзOrders 		= МассивРезультатов[0].Выгрузить();
	тзCustomer 		= МассивРезультатов[1].Выгрузить();
	тзAddress 		= МассивРезультатов[2].Выгрузить();
	тзCarrier 		= МассивРезультатов[3].Выгрузить(); 
	тзOrderLines 	= МассивРезультатов[4].Выгрузить();
	тзУслуги 		= МассивРезультатов[5].Выгрузить();
	
	МассивOrders = Новый Массив;
	                                                                                  
	Для Каждого ДокЗаказ Из МассивСсылок Цикл 
		
		ЗаполнитьДанные(МассивOrders, тзOrders, тзCustomer, тзAddress, тзCarrier, тзOrderLines, тзУслуги, ДокЗаказ);
		
	КонецЦикла;
	//OrderLines = Новый Структура;
	
	MessageIdentification = Неопределено;
	ЗаполнитьСтруктуруMessageIdentification(MessageIdentification, СтруктураСоединения.СтруктураШапки);
	СтруктураОтправки = Новый Структура("MessageIdentification, Orders", MessageIdentification, МассивOrders);

	
	
	КаталогВременныъхфайлов = КаталогВременныхФайлов(); 
	ПутьКФайлу = КаталогВременныъхфайлов + "PostOrders.json";
	тЗапись = Новый ЗаписьJSON;
	//тЗапись.ПроверятьСтруктуру = ЛОЖЬ;
	тЗапись.ОткрытьФайл(ПутьКФайлу);
	
	ЗаписатьJSON(тЗапись, СтруктураОтправки, Новый НастройкиСериализацииJSON, "ФункцияПреобразования", ВыгрузкаЗаказовНаСкладСервер);
	тЗапись.Закрыть();
	
	ЧтениеJson = Новый ЧтениеТекста;
	ЧтениеJson.Открыть(ПутьКФайлу, КодировкаТекста.UTF8);
	
	ТекстJson = ЧтениеJson.Прочитать();
	ТекстОтправки = СтрЗаменить(ТекстJson, """_null""", "null");
	ТекстОтправки = СокрЛП(СтрЗаменить(ТекстОтправки, Символы.НПП, ""));
	ТекстОтправки = СтрЗаменить(ТекстОтправки, " ", "");
	ЧтениеJson.Закрыть();
	
	
	АдресРесурса = "/api/interfacing/orders";//"/swagger/docs/v1"+"/api/interfacing/orders";
	
	Результат = ПолучитьМассивОбъектов2(СтруктураСоединения.Соединение,СтруктураСоединения.Заголовки,АдресРесурса,"POST", ТекстОтправки, ПутьКФайлу);

	Если НЕ Результат = Неопределено Тогда 
		
		ЗаказОбъект = ДокЗаказ.ПолучитьОбъект();
		ЗаказОбъект.УИДСоСклада = Результат;
		
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
		
	КонецЕсли;
	
	УдалитьФайлы(ПутьКФайлу);
	
КонецПроцедуры

Функция ПолучитьМассивОбъектов2(Соединение,Заголовки,АдресРесурса,МетодЗапроса="GET", ТекстОтправки, ПутьКФайлу);
	//ПЕРЕМ mhttp;
	
	mhttp = Неопределено;
	
	Сервер = "https://swllc1.coraxwms.nl/";
	
	Если mhttp = Неопределено Тогда
		mhttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1"); 
	Конецесли;	
	
	mhttp.SetTimeouts(6000000, 6000000, 6000000, 6000000);

	mhttp.open("POST", Сервер+ "api/interfacing/orders/", False); 
	
	mhttp.setRequestHeader("POST", "https://swllc1.coraxwms.nl/api/interfacing/orders HTTP/1.1");
	mhttp.setRequestHeader("Authorization", "WRAP access_token=""31656759-708d-4900-b215-6e4e4fca72e5""");
	mhttp.setRequestHeader("Accept", "application/json");
	mhttp.setRequestHeader("User-Agent", "RestSharp/106.3.1.0");
	mhttp.setRequestHeader("Content-Type", "application/json");
	mhttp.setRequestHeader("Host", "swllc1.coraxwms.nl"); //
	mhttp.setRequestHeader("Content-length", "1301");
	mhttp.setRequestHeader("Accept-Encoding", "gzip, deflate");
	
	Попытка        
		mhttp.send(ТекстОтправки);
		res = mhttp.WaitForResponse();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='ინფორმაციის გადაცემის შეცდომა! შეამოწმეთ აწყობის პარამეტრების შევსება';ru='Ошибка передачи информации! Проверьте правильность заполнения настроек';en='Information Communication error! Check the correctness of the settings'");
		Сообщить(ОписаниеОшибки());
		ПриЗагрузкеВозниклиОшибки = Истина
	КонецПопытки;
	
	Если Не res Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='კავშირის შეცდომა';ru='Ошибка связи';en='communication error'");
		Сообщение.Сообщить(ОписаниеОшибки());
		ПриЗагрузкеВозниклиОшибки = Истина
	Конецесли;
	
	СтрокаJSONРезультат = mhttp.responseText;
	
	КодОшибки = mhttp.Status;
	КраткоеОписание = mhttp.StatusText;
	
	Если mhttp.StatusText = "Accepted" Тогда 
		ПозицияУИД_Начало = Найти(СтрокаJSONРезультат, "Order");  //23
		
		УИД = Сред(СтрокаJSONРезультат, ПозицияУИД_Начало + 5 ,36);
		
		Сообщить(mhttp.StatusText);
	Иначе
		Сообщить("Ошибка: " + КодОшибки + ": " + КраткоеОписание);
		Возврат Неопределено;
		Сообщить(СтрокаJSONРезультат);
	КонецЕсли;
	
	Возврат УИД;
	
КонецФункции // ПолучитьМассивОбъектов(СтруктураСоединения.Соединение,СтруктураСоединения.Заголовки,АдресРесурса,"POST", ТекстОтправки, ПутьКФайлу)()


Функция ПолучитьМассивОбъектов(Соединение,Заголовки,АдресРесурса,МетодЗапроса="GET", ТекстОтправки, ПутьКФайлу) ЭКСПОРТ
	ПЕРЕМ РЕЗ,Данные;
	
	РЕЗ = Новый Структура("КодСостояния,КоличествоСтраниц,Данные");
	                                                                                        
	Запрос = Новый HTTPЗапрос("/api/interfacing/orders/", Заголовки);
	//Запрос.АдресРесурса = АдресРесурса;
	//Запрос.АдресРесурса = Запрос.АдресРесурса+"&page="+НомерСтраницы;
	//Запрос.Заголовки = Заголовки;
	Запрос.УстановитьТелоИзСтроки(ТекстОтправки, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.Использовать);
	//Запрос.УстановитьИмяФайлаТела(ПутьКФайлу); 
	
	Результат = Соединение.Получить(Запрос);
	Результат = Соединение.ОтправитьДляОбработки(Запрос); //ВызватьHTTPМетод(МетодЗапроса, Запрос);
	
	РЕЗ.КодСостояния = Результат.КодСостояния;
	
	Если Результат.КодСостояния = 200 Тогда
		
		РЕЗ.Данные = Данные;
		
	Иначе
		
		Сообщить(Результат.ПолучитьТелоКакСтроку());
		
	КонецЕсли;
	
	Возврат РЕЗ;
	
КонецФункции

Процедура ЗаполнитьДанные(МассивOrders, тзOrders, тзCustomer, тзAddress, тзCarrier, тзOrderLines, тзУслуги, ДокЗаказ)
	
	СтрокиOrders 		= тзOrders.НайтиСтроки(Новый Структура("Ссылка", ДокЗаказ));
	СтрокиCustomer 		= тзCustomer.НайтиСтроки(Новый Структура("Ссылка", ДокЗаказ));
	СтрокиAddress 		= тзAddress.НайтиСтроки(Новый Структура("Ссылка", ДокЗаказ));
	СтрокиCarrier 		= тзCarrier.НайтиСтроки(Новый Структура("Ссылка", ДокЗаказ));
	СтрокиOrderLines 	= тзOrderLines.НайтиСтроки(Новый Структура("Ссылка", ДокЗаказ));
	СтрокиУслуг 		= тзУслуги.НайтиСтроки(Новый Структура("Ссылка", ДокЗаказ));
	
	СтруктураOrders = Новый Структура;
	
	Для Каждого Колонка Из тзOrders.Колонки Цикл 
		
		Если Колонка.Имя = "Ссылка" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если СтрокиOrders.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрOrders = СтрокиOrders[0];
		
		Если Колонка.Имя = "OrderId" Тогда 
			СтруктураOrders.Вставить(Колонка.Имя, СтрЗаменить(СтрЗаменить(Строка(СтрOrders[Колонка.Имя]), " ", ""), Символы.НПП, ""));
		Иначе 
			СтруктураOrders.Вставить(Колонка.Имя, СтрOrders[Колонка.Имя]);
		КонецЕсли;
		
		Если Колонка.Имя = "OutboundDock" Тогда
			
			СтруктураCustomer = ЗаполнитьДанныеCustomer(тзCustomer.Колонки, тзAddress.Колонки, СтрокиCustomer, СтрокиAddress);
			СтруктураOrders.Вставить("Customer", СтруктураCustomer);
			
			//СтруктураCarrier = ЗаполнитьДанныеCarrier(тзCarrier.Колонки, СтрокиCarrier);
			//СтруктураOrders.Вставить("Carrier", СтруктураCarrier);
			///
			МассивOrderLines = ЗаполнитьДанныеOrderLines(тзOrderLines.Колонки, СтрокиOrderLines, СтрокиУслуг);
			СтруктураOrders.Вставить("OrderLines", МассивOrderLines);
			
		КонецЕсли; 
		
		Если Колонка.Имя = "Notes" Тогда 
			ТекстNotes = "";
			ИтогСумма = 0;
			Для Каждого СтрУслуги Из СтрокиУслуг Цикл 
				
				Если ЗначениеЗаполнено(СтрУслуги.МетодОплаты) Тогда 
					ТекстNotes = "ტრანსპორტირება";//ТекстNotes + СтрУслуги.МетодОплаты;
					//Прервать;
				КонецЕсли;
				
				ИтогСумма = ИтогСумма + СтрУслуги.Сумма;
			КонецЦикла;
			
			ТекстNotes = ТекстNotes + ", " + ИтогСумма;
			Если ТекстNotes <> "" Тогда
				СтруктураOrders.Вставить("Notes", ТекстNotes);
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
	МассивOrders.Добавить(СтруктураOrders);

КонецПроцедуры

Функция ЗаполнитьДанныеOrderLines(КолонкиOrderLines, СтрокиOrderLines, СтрокиУслуг)

	Если СтрокиOrderLines.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	МассивВозврата = Новый Массив;
	
	Для Каждого СтрокрЗапасы Из СтрокиOrderLines Цикл 
		
		СтруктураЛинии = Новый Структура;
		
		Для Каждого Колонка Из КолонкиOrderLines Цикл 
			
			Если Колонка.Имя = "Ссылка" ИЛИ Колонка.Имя = "ItemUnitOfMeasure" ИЛИ Колонка.Имя = "Amount" Тогда 
				Продолжить;
			КонецЕсли;
			
			
			Если Колонка.Имя = "Reference" Тогда 
				СтруктураЛинии.Вставить(Колонка.Имя, Строка(СтрокрЗапасы[Колонка.Имя]));
			Иначе 
				СтруктураЛинии.Вставить(Колонка.Имя, СтрокрЗапасы[Колонка.Имя]);
			КонецЕсли;
			
			Если Колонка.Имя = "Specifications" Тогда 
				СтруктураQuantityOrdered = Новый Структура("ItemUnitOfMeasure, Amount", СтрокрЗапасы.ItemUnitOfMeasure, СтрокрЗапасы.Amount);
				СтруктураЛинии.Вставить("QuantityOrdered", СтруктураQuantityOrdered);
			КонецЕсли;
			
			//Если Колонка.Имя = "Notes" Тогда 
			//	ТекстNotes = "";
			//	Для Каждого СтрУслуги Из СтрокиУслуг Цикл 
			//		
			//		//Если ЗначениеЗаполнено(СтрУслуги.МетодОплаты) Тогда 
			//		//	ТекстNotes = ТекстNotes + СтрУслуги.МетодОплаты + ", ";
			//		//КонецЕсли;
			//		
			//		ТекстNotes = ТекстNotes + "ტრანსპორტირებით, " + СтрУслуги.Сумма;
			//		
			//	КонецЦикла;
			//	СтруктураЛинии.Вставить("Notes", ТекстNotes);
			//КонецЕсли;
			
		КонецЦикла;
		
		МассивВозврата.Добавить(СтруктураЛинии);
		
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции // ЗаполнитьДанныеOrderLines(тзOrderLines.Колонки, СтрокиOrderLines)()

Функция ЗаполнитьДанныеCarrier(КолонкиCarrier, СтрокиCarrier)

	СтруктураВозврата = Новый Структура;
	
	Если СтрокиCarrier.Количество() = 0 Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтрCarrier = СтрокиCarrier[0];
	
	Для Каждого Колонка ИЗ КолонкиCarrier Цикл 
		
		Если Колонка.Имя = "Ссылка" Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураВозврата.Вставить(Колонка.Имя, СтрCarrier[Колонка.Имя]);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;

КонецФункции // СтруктураCarrier = ЗаполнитьДанныеCarrier(тзCarrier.Колонки, СтрокиCarrier)()


Функция ЗаполнитьДанныеCustomer(КолонкиCustomer, КолонкиAddress, СтрокиCustomer, СтрокиAddress)
	
	СтруктураВозврата = Новый Структура;
	
	Если СтрокиCustomer.Количество() = 0 Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтрCustomer = СтрокиCustomer[0];
	
	Для Каждого Колонка ИЗ КолонкиCustomer Цикл 
		
		Если Колонка.Имя = "Ссылка" Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураВозврата.Вставить(Колонка.Имя, СтрCustomer[Колонка.Имя]);
		
		Если Колонка.Имя = "MinRemainingShelfLife" Тогда 
			СтруктураAddress = ЗаполнитьДанныеAddress(КолонкиAddress, СтрокиAddress);
			СтруктураВозврата.Вставить("Address", СтруктураAddress);
			//СтруктураBillingAddress = ЗаполнитьДанныеBillingAddress();
			//СтруктураВозврата.Вставить("BillingAddress", СтруктураAddress);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ЗаполнитьДанныеПокупателя(СтрокиCustomer, СтрокиAddress)()

Функция ЗаполнитьДанныеBillingAddress()

	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("BillingAddressReference", "_null");
	СтруктураВозврата.Вставить("BillingAddressLine"		, "_null");
	СтруктураВозврата.Вставить("BillingAddressLine2"	, "_null");
	СтруктураВозврата.Вставить("BillingZipCode"			, "_null");
	СтруктураВозврата.Вставить("BillingCity"			, "_null");
	СтруктураВозврата.Вставить("BillingState"			, "_null");
	СтруктураВозврата.Вставить("BillingCountry"			, "_null");
	
	Возврат СтруктураВозврата;

КонецФункции // ЗаполнитьДанныеBillingAddress()

Функция ЗаполнитьДанныеAddress(КолонкиAddress, СтрокиAddress)
	
	СтруктураВозврата = Новый Структура;
	
	Если СтрокиAddress.Количество() = 0 Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтрAddress = СтрокиAddress[0];
	
	Для Каждого Колонка ИЗ КолонкиAddress Цикл 
		
		Если Колонка.Имя = "Ссылка" Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураВозврата.Вставить(Колонка.Имя, СтрAddress[Колонка.Имя]);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ФункцияПреобразования(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
 Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
 Возврат Строка(Значение);
 КонецЕсли;
 Отказ = Истина;
КонецФункции

Процедура ЗаполнитьСтруктуруMessageIdentification(MessageIdentification, СтруктураШапки)
	
	MessageIdentification = Новый Структура;
	
	MessageIdentification.Вставить("Tenant"					, СтруктураШапки.Tenant);	
	MessageIdentification.Вставить("DateTimeCreated"		, ТекущаяДата());
	MessageIdentification.Вставить("Sender"					, СтруктураШапки.Sender);
	MessageIdentification.Вставить("Receiver"				, НЕОПРЕДЕЛЕНО);
	MessageIdentification.Вставить("MessageType"			, СтруктураШапки.MessageType);
	MessageIdentification.Вставить("Version"				, СтруктураШапки.Version);
	MessageIdentification.Вставить("TestIndicator"			, СтруктураШапки.TestIndicator);
	MessageIdentification.Вставить("HandlingInterfaces"		, СтруктураШапки.HandlingInterfaces);
	MessageIdentification.Вставить("OutputFormatInterfaces"	, СтруктураШапки.OutputFormatInterfaces);
	MessageIdentification.Вставить("SenderRef4erence"		, НЕОПРЕДЕЛЕНО);
	
КонецПроцедуры

Функция ПолучитьДанныеДокуента(МассивСсылок)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		///////////////////////// Orders
		"ВЫБРАТЬ
		|	ЗаказПокупателяЗапасы.Ссылка КАК Ссылка,
		//|	ЗаказПокупателяЗапасы.Ссылка.Контрагент.Наименование КАК Client,
		|	""Karcher"" КАК Client,
		|	НЕОПРЕДЕЛЕНО КАК RevisionNo,
		//|	СопоставлениеЗаказПокупателяWordPress.id КАК OrderId,
		|	ЗаказПокупателяЗапасы.Ссылка.Номер КАК OrderId,
		//|	25120 КАК OrderId,
		|	НЕОПРЕДЕЛЕНО КАК Reference,
		|	""Standard"" КАК OrderType,
		|	""Registered"" КАК Status,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяЗапасы.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЗаказПокупателяЗапасы.ДатаОтгрузки
		|	КОНЕЦ КАК DeliveryDate,
		|	НЕОПРЕДЕЛЕНО КАК ShippingDate,
		|	НЕОПРЕДЕЛЕНО КАК StagingLocation,
		|	"""" КАК OutboundDock,
		|	НЕОПРЕДЕЛЕНО КАК HandlingUnitType,
		|	НЕОПРЕДЕЛЕНО КАК Notes,
		|	НЕОПРЕДЕЛЕНО КАК TransportReference,
		|	НЕОПРЕДЕЛЕНО КАК Incoterm,
		|	ЛОЖЬ КАК ClaimInventory,
		|	НЕОПРЕДЕЛЕНО КАК AdditionalAttributes,
		|	НЕОПРЕДЕЛЕНО КАК BlockOrder,
		|	ЛОЖЬ КАК IsBlanketOrder,
		|	НЕОПРЕДЕЛЕНО КАК NewOwner
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеЗаказПокупателяWordPress КАК СопоставлениеЗаказПокупателяWordPress
		|		ПО ЗаказПокупателяЗапасы.Ссылка = СопоставлениеЗаказПокупателяWordPress.ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателяЗапасы.Ссылка В(&МассивСсылок)
		|	И ЗаказПокупателяЗапасы.НомерСтроки = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		////////////////////////// Customer
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка,
		//|	ЗаказПокупателя.Контрагент.Наименование КАК Client,
		|	""Karcher"" КАК Client,
		|	ЗаказПокупателя.Контрагент.НаименованиеПолное КАК Name,
		//|	ЗаказПокупателя.Контрагент.Код КАК CustomerId,
		|	ЗаказПокупателя.Контрагент.ИНН КАК CustomerId,
		|	НЕОПРЕДЕЛЕНО КАК Reference,
		|	Мейл.Представление КАК Email,
		|	Телефон.Представление КАК Phone,
		|	НЕОПРЕДЕЛЕНО КАК PreferredLanguage,
		|	НЕОПРЕДЕЛЕНО КАК LoadingProfile,
		|	НЕОПРЕДЕЛЕНО КАК MinRemainingShelfLife,
		|	НЕОПРЕДЕЛЕНО КАК MinRemainingShelfLifeUom,
		|	ЛОЖЬ КАК AreShippingAndBillingAddressTheSame,
		|	ИСТИНА КАК SaveCustomerPermanent,
		//|	ЗаказПокупателя.Комментарий КАК Notes
		//|	НЕОПРЕДЕЛЕНО КАК Notes
		|	ЗаказПокупателяДополнительныеРеквизиты.Значение  КАК Notes
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК Мейл
		//|		ПО ЗаказПокупателя.Контрагент = Мейл.Ссылка
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК Телефон
		//|		ПО ЗаказПокупателя.Контрагент = Телефон.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК Мейл
		|		ПО ЗаказПокупателя.Контрагент = Мейл.Ссылка
		|			И (ВЫБОР
		|				КОГДА Мейл.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК Телефон
		|		ПО ЗаказПокупателя.Контрагент = Телефон.Ссылка
		|			И (ВЫБОР
		|				КОГДА Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.ДополнительныеРеквизиты КАК ЗаказПокупателяДополнительныеРеквизиты
		|		ПО ЗаказПокупателя.Ссылка = ЗаказПокупателяДополнительныеРеквизиты.Ссылка
		|			И (ВЫБОР
		|				КОГДА ЗаказПокупателяДополнительныеРеквизиты.Свойство.Наименование = ""payment_method_title""
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		//|	Мейл.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		//|	И Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		//|	И ЗаказПокупателя.Ссылка В (&МассивСсылок)
		|	ЗаказПокупателя.Ссылка В (&МассивСсылок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		/////////////////////// Address
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка,
		|	НЕОПРЕДЕЛЕНО КАК AddressReference,
		|	ЗаказПокупателяДополнительныеРеквизиты.Значение КАК AddressLine,
		|	"""" КАК AddressLine2,
		|	"""" КАК ZipCode,
		|	""Tbilisi"" КАК City,
		|	"""" КАК State,
		|	""Georgia"" КАК Country
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.ДополнительныеРеквизиты КАК ЗаказПокупателяДополнительныеРеквизиты
		|		ПО ЗаказПокупателя.Ссылка = ЗаказПокупателяДополнительныеРеквизиты.Ссылка
		|			И (ВЫБОР
		|				КОГДА ЗаказПокупателяДополнительныеРеквизиты.Свойство.Наименование = ""მიწოდების მისამართი""
		|					ИЛИ ЗаказПокупателяДополнительныеРеквизиты.Свойство.Наименование = ""მიწოდების მისამართი (მყიდველთა შეკვეთები)""
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	ЗаказПокупателя.Ссылка В (&МассивСсылок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		/////////////// Carrier
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка,
		|	"""" КАК CarrierId,
		|	"""" КАК Name,
		|	"""" КАК Reference
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка В (&МассивСсылок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//////////////////////// OrderLines
		|ВЫБРАТЬ
		|	ЗаказПокупателяЗапасы.Ссылка КАК Ссылка,
		|	ЗаказПокупателяЗапасы.Номенклатура.Артикул КАК Item,
		|	ЗаказПокупателяЗапасы.НомерСтроки КАК Reference,
		|	НЕОПРЕДЕЛЕНО КАК Specifications,
		|	""Piece"" КАК ItemUnitOfMeasure,
		|	ЗаказПокупателяЗапасы.Количество КАК Amount,
		|	НЕОПРЕДЕЛЕНО КАК Assignments,
		//|	НЕОПРЕДЕЛЕНО КАК Notes,
		//|	ЗаказПокупателяЗапасы.Цена КАК Notes,
		|   ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА НЕ ЗаказПокупателяЗапасы.Ссылка.СуммаВключаетНДС
		|           ТОГДА ЗаказПокупателяЗапасы.Цена + (ЗаказПокупателяЗапасы.Цена * 0.18)
		|       ИНАЧЕ ЗаказПокупателяЗапасы.Цена
		|   КОНЕЦ КАК ЧИСЛО(15,2)) КАК Notes,
		|	ЛОЖЬ КАК SpecifyStock,
		|	НЕОПРЕДЕЛЕНО КАК DetailPickAllowed,
		|	НЕОПРЕДЕЛЕНО КАК AdditionalAttributes,
		|	НЕОПРЕДЕЛЕНО КАК IsChanged,
		|	НЕОПРЕДЕЛЕНО КАК BlanketOrder,
		|	ЛОЖЬ КАК SerialNumberInboundRegistration,
		|	НЕОПРЕДЕЛЕНО КАК LinkedReceiptId,
		|	НЕОПРЕДЕЛЕНО КАК LinkedReceiptReference,
		|	НЕОПРЕДЕЛЕНО КАК LinkedReceiptLineReference
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|ГДЕ
		|	ЗаказПокупателяЗапасы.Ссылка В(&МассивСсылок)
		|	И ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//////////////////////// Услуги
		|ВЫБРАТЬ
		|	ЗаказПокупателяЗапасы.Ссылка,
		//|	СУММА(ЗаказПокупателяЗапасы.Сумма) КАК Сумма,
		|   СУММА(ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА НЕ ЗаказПокупателяЗапасы.Ссылка.СуммаВключаетНДС
		|           ТОГДА ЗаказПокупателяЗапасы.Сумма + (ЗаказПокупателяЗапасы.Сумма * 0.18)
		|       ИНАЧЕ ЗаказПокупателяЗапасы.Сумма
		|   КОНЕЦ КАК ЧИСЛО(15,2))) КАК Сумма,
		|	ЗаказПокупателяДополнительныеРеквизиты.Значение КАК МетодОплаты
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.ДополнительныеРеквизиты КАК ЗаказПокупателяДополнительныеРеквизиты
		|		ПО ЗаказПокупателяЗапасы.Ссылка = ЗаказПокупателяДополнительныеРеквизиты.Ссылка
		|			И (ВЫБОР
		|				КОГДА ЗаказПокупателяДополнительныеРеквизиты.Свойство.Наименование = ""payment_method_title""
		|					ИЛИ ЗаказПокупателяДополнительныеРеквизиты.Свойство.Наименование = ""payment_method_title (მყიდველთა შეკვეთები)""
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	ЗаказПокупателяЗапасы.Ссылка В (&МассивСсылок)
		|	И ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыНоменклатуры.Услуга)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяЗапасы.Ссылка,
		|	ЗаказПокупателяДополнительныеРеквизиты.Значение";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции // ПолучитьДанныеДокуента(СсылкаЗаказа)()

Функция ЗаполнитьСтруктуру(ТаблицаЗначений)

	Если ТаблицаЗначений.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаТаблицы = ТаблицаЗначений[0];
		
	СтруктураВозврата = Новый Структура;
	
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл 
		СтруктураВозврата.Вставить(Колонка.Имя, "");
	КонецЦикла;
	
	Для Каждого Элем Из СтруктураВозврата Цикл 
		СтруктураВозврата[Элем.Ключ] = СтрокаТаблицы[Элем.Ключ];
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ЗаполнитьСтруктуру()
